# Task 4.9 Part - 1

## 1. Importing Libraries and Dataframe.

In [65]:
# Importing libraries.
import pandas as pd
import numpy as np
import os

In [66]:
# Defining path.
path = r'/Users/Ayaz/Desktop/Instacart Basket Analysis'

In [67]:
# Importing 'customers.csv' dataframe.
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [68]:
# Importing 'orderds_products_clean' dataframe.
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_cleaned.pkl'))

In [69]:
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,...,busiest_day,busiest_days,besiest_period_of_day,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Regularly busy,Regularly days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Regularly busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Regularly busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Least busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Least busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer

In [70]:
ords_prods.shape

(32404859, 26)

In [71]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [72]:
# Cheking the size of customers.csv dataframe
customers.shape

(206209, 10)

## 2. Wrangling Customers Dataset

In [73]:
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

### 2.a Renaming and Droping Columns

In [74]:
# Changing all columns name to lowercase letters 
customers.rename(columns = {'First Name' : 'first name'}, inplace = True)

In [75]:
# changing the Surnam column to last name
customers.rename(columns = {'Surnam' : 'last name'},inplace=True)

In [76]:
customers.rename(columns = {'Gender' : 'gender'},inplace = True)

In [77]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [78]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [79]:
customers.rename(columns = {'n_dependants' : 'dependants'}, inplace = True)

In [80]:
customers.rename(columns = {'fam_status' : 'marital status'}, inplace = True)

In [81]:
customers.rename(columns = {'date_joined' : 'joined date'}, inplace = True)

In [82]:
customers.head()

,user_id,first name,last name,gender,state,age,joined date,dependants,marital status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 3. Data Quality and Consistency Checks

### 3a. Descriptive Statistics of Customers.csv Dataframe

In [83]:
# Checking basic statistics of customer dataframe
customers.describe()

             user_id            age     dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [84]:
# Checking data type in customers dataframe
customers.dtypes

user_id            int64
first name        object
last name         object
gender            object
state             object
age                int64
joined date       object
dependants         int64
marital status    object
income             int64
dtype: object

In [85]:
# changing the data type of user_id column to string in customers.csv dataframe
customers['user_id'] = customers['user_id'].astype('str')

In [86]:
customers['user_id'].dtype

dtype('O')

In [87]:
# changing the data type of user_id in 'ords_prods' dataframe
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [88]:
ords_prods['user_id'].dtype

dtype('O')

In [89]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                object
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   new_customer           bool
 7   product_id             int64
 8   add_to_cart_order      int64
 9   reordered              int64
 10  product_name           object
 11  aisle_id               int64
 12  department_id          int64
 13  prices                 float64
 14  _merge                 category
 15  price_range_loc        object
 16  busiest_day            object
 17  busiest_days           object
 18  besiest_period_of_day  object
 19  busiest_period_of_day  object
 20  max_order              int64
 21  loyalty_flag           object
 22  average_price          float64
 23  spending_flag          object
 24  median_days            float64
 25  frequency_flag         object
dtypes: bool(1), category(1), float64(4), int64(10), object(10)
memory usage: 6.1+ GB

### 3b. Checking for Missing Values in Customers dataframe.

In [90]:
# checking basic infomation of 'customers.csv' dataframe.
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  object
 1   first name      194950 non-null  object
 2   last name       206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   joined date     206209 non-null  object
 7   dependants      206209 non-null  int64
 8   marital status  206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(3), object(7)
memory usage: 15.7+ MB

Observation: In first name column there are 11259 missing data.

In [91]:
# checking the missing values in first name column.
customers['first name'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: first name, Length: 208, dtype: int64

Observation: Confirmed that there are NaN values in first name column.
since it is string column we can leave that as it is because it will not affect the statistics analysis.

In [92]:
# checking for null values in 'customers' dataframe
customers.isnull().sum()

user_id               0
first name        11259
last name             0
gender                0
state                 0
age                   0
joined date           0
dependants            0
marital status        0
income                0
dtype: int64

### 3c. Checking Mixed Data Types

In [93]:
# checking for mixed data type i customer dataframe
for col in customers.columns.tolist():
    weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

first name

Obervation: first name column is mixed because it has null values in it. The rest of columns are fine. we can change the data type of first name column to string to fix this.

In [94]:
# changing the data type of first name column
customers['first name'] = customers['first name'].astype('str')

In [95]:
# after the changes rechecking the missing values in customers dataframe
customers.isnull().sum()

user_id           0
first name        0
last name         0
gender            0
state             0
age               0
joined date       0
dependants        0
marital status    0
income            0
dtype: int64

### 3d. Duplicate Values

In [96]:
# checking for duplicate vales in customers dataframe
df_dups = customers[customers.duplicated()]

In [97]:
df_dups

Empty DataFrame
Columns: [user_id, first name, last name, gender, state, age, joined date, dependants, marital status, income]
Index: []

Observation: There are no duplicate data in customers.csv dataframe.

## 4. Cumbine Dataframes

In [98]:
# Checking the dataframes for key column to combine
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,...,busiest_day,busiest_days,besiest_period_of_day,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Regularly busy,Regularly days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Regularly busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Regularly busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Least busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Least busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer

In [99]:
# Checking datatype to be sure it same to combine.
ords_prods.dtypes

order_id                    int64
user_id                    object
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
new_customer                 bool
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
_merge                   category
price_range_loc            object
busiest_day                object
busiest_days               object
besiest_period_of_day      object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_price             float64
spending_flag              object
median_days               float64
frequency_flag             object
dtype: object

In [100]:
customers.dtypes

user_id           object
first name        object
last name         object
gender            object
state             object
age                int64
joined date       object
dependants         int64
marital status    object
income             int64
dtype: object

In [101]:
# droping the _merge column from ords_prods dataframe for new merge
ords_prods = ords_prods.drop(columns = ['_merge'])

In [102]:
# checking the output 
ords_prods.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,new_customer,product_id,add_to_cart_order,reordered,...,busiest_day,busiest_days,besiest_period_of_day,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Regularly busy,Regularly days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Regularly busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
2,473747,1,3,3,12,21.0,False,196,1,1,...,Regularly busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Least busy,Slowest days,Average orders,Average orders,10,New customer,6.367797,Low spender,20.5,Regular customer
4,431534,1,5,4,15,28.0,False,196,1,1,...,Least busy,Slowest days,Most orders,Most orders,10,New customer,6.367797,Low spender,20.5,Regular customer

In [103]:
# Checking the size of dataframe
ords_prods.shape

(32404859, 25)

In [104]:
customers.shape

(206209, 10)

In [ ]:
# Combining the dataframes on key columns 'user_id'
df_ords_prods_merge = customers.merge(ords_prods, on = 'user_id', indicator = True)

In [ ]:
# Checking the merge value counts
df_ords_prods_merge['_merge'].value_counts(dropna = False)

In [ ]:
# Checking the new dataframe size
df_ords_prods_merge.shape

In [ ]:
df_ords_prods_merge.head(30)

## 5. Exporting Data

In [ ]:
# Exporting new merged dataframe as pickle file
df_ords_prods_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'IC_merged.pkl'))